app/views/admin/breeds/index.html.erb

SELECT "genres".* FROM "genres"
---
   <%= form_tag admin_breeds_path, method: :get do %>
      <%= select_tag :genre_id,
                     options_from_collection_for_select(Genre.all, :id, :name, params[:genre_id]),
                     {