app/views/favorites/_favorites.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."article_id" = ?  [["article_id", 7]]
---
<%= link_to admin_article_favorites_path(article), method: :post, remote: true do %>
  <div id="iineCount">♥<%= article.favorites.count %>いいね</div>