app/controllers/admin/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."ip" = ? AND "favorites"."article_id" IS NULL LIMIT ?  [["ip", "122.196.81.26"], ["LIMIT", 1]]
---
  def index
    @articles_all = Article.all.page(params[:page]).per(3)
    @articles = Article.all.order(created_at: :desc)
    @favorite = Favorite.find_by(ip: request.remote_ip, article_id: params[:article_id])

INSERT INTO "articles" ("title", "sentence", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "rr"], ["sentence", "rr"], ["image_id", nil], ["created_at", "2021-06-21 09:42:57.233337"], ["updated_at", "2021-06-21 09:42:57.233337"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
  def show
    @article = Article.find(params[:id])
    @comment = Comment.new
    @comments_all = Comment.all.page(params[:page]).per(3)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
UPDATE "articles" SET "sentence" = ?, "image_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["sentence", "jjaa"], ["image_id", "81ebe6d9e326eba91df24fec50c6ff20ac139421bcf4c583aacd2079031f"], ["updated_at", "2021-06-24 20:21:47.763691"], ["id", 47]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 24]]
---
  def destroy
    article = Article.find(params[:id])
    article.destroy