app/controllers/admin/breeds_controller.rb

  def index
    @breed_all = Breed.all.page(params[:page]).per(10)
    @breeds = params[:genre_id].present? ? Genre.find(params[:genre_id]).breeds : Breed.all
---
SELECT  "breeds".* FROM "breeds" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "breeds"
SELECT "breeds".* FROM "breeds" WHERE "breeds"."genre_id" = ?  [["genre_id", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @genres = Genre.all
    @breed = Breed.new(breed_params)
    if @breed.save
---
SELECT "genres".* FROM "genres"
INSERT INTO "breeds" ("title", "sentence", "image_id", "updated_at", "created_at") VALUES (?, ?, ?, ?, ?)  [["title", "nn"], ["sentence", "nn"], ["image_id", nil], ["updated_at", "2021-06-24 20:24:10.861135"], ["created_at", "2021-06-24 20:24:10.861135"]]

  def show
    @breed = Breed.find(params[:id])
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @breed = Breed.find(params[:id])
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @breed = Breed.find(params[:id])
    if @breed.update(breed_params)
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "breeds" SET "genre_id" = ?, "image_id" = ?, "updated_at" = ? WHERE "breeds"."id" = ?  [["genre_id", 1], ["image_id", "74d3f85aa9a2d4a9e8ee1f18eead426fe36241460b879d393528a4174f5d"], ["updated_at", "2021-06-18 14:56:47.292829"], ["id", 1]]

  def destroy
      breed = Breed.find(params[:id])
      breed.destroy
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "breeds" WHERE "breeds"."id" = ?  [["id", 5]]

  def set_genres
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"