app/controllers/admin/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = Comment.new(comment_params)
    @comment.article_id = @article.id
    if @comment.save
      flash[:notice] = "コメントしました"
      redirect_to admin_article_path(@article)
    else
    @comments = @article.comments.page(params[:page]).reverse_order
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "name", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "dd"], ["name", "dd"], ["article_id", 3], ["created_at", "2021-06-19 15:23:48.086108"], ["updated_at", "2021-06-19 15:23:48.086108"]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 24]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? AND "comments"."article_id" = ? LIMIT ?  [["id", 1], ["article_id", 3], ["LIMIT", 1]]

  def destroy
    Comment.find_by(id: params[:id], article_id: params[:article_id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 18]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? AND "comments"."article_id" = ? LIMIT ?  [["id", 18], ["article_id", 47], ["LIMIT", 1]]