app/controllers/admin/favorites_controller.rb

  def create
  @article = Article.find(params[:article_id])
  @favorite = Favorite.find_by(ip: request.remote_ip, article_id: params[:article_id])
   if @favorite
        flash[:notice] = "すでにいいねしています"
        redirect_to admin_article_path(@article.id)
   else
     @favorite = Favorite.create(article_id: params[:article_id], ip: request.remote_ip)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."ip" = ? AND "favorites"."article_id" = ? LIMIT ?  [["ip", "122.196.81.26"], ["article_id", 3], ["LIMIT", 1]]
INSERT INTO "favorites" ("article_id", "ip", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 3], ["ip", "122.196.81.26"], ["created_at", "2021-06-20 07:05:34.851337"], ["updated_at", "2021-06-20 07:05:34.851337"]]