app/controllers/admin/genres_controller.rb

    def create
        genre = Genre.new(genre_params)
        if genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "いちご"], ["created_at", "2021-06-13 08:43:47.961007"], ["updated_at", "2021-06-13 08:43:47.961007"]]

    def update
        @genre = Genre.find(params[:id])
        if @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "その他"], ["updated_at", "2021-06-14 06:21:48.172090"], ["id", 3]]