app/views/admin/articles/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
        <td class="article-all__article-date">
          <%= link_to "#{article.comments.count} コメント", admin_article_path(article.id) %>

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."article_id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."article_id" = ?  [["article_id", 3]]
---
        <td class="article-option">
          <%= link_to "#{article.favorites.count}", admin_article_path(article.id) %>