app/views/admin/articles/show.html.erb

   <%= link_to admin_article_favorites_path(@article), method: :post, local:true do %>
  <div>♥<%= @article.favorites.count %>いいね</div>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."article_id" = ?  [["article_id", 44]]

  <div class="article-show__article-comment col-5">
    <div>コメント件数：<%= @article.comments.count %></div>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 44]]