app/controllers/events_controller.rb

INSERT INTO "events" ("number", "plan_day", "tel", "last_name", "first_name", "last_name_kana", "first_name_kana", "email", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
     if params[:back]
       render :new
     else @event.save!

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @event = Event.find_by(id: params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    event = Event.find(params[:id])
    event.destroy