app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("rate", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["rate", 2.5], ["text", "dd"], ["created_at", "2021-06-24 08:09:42.140575"], ["updated_at", "2021-06-24 08:09:42.140575"]]

  def destroy
    review = Review.find(params[:id])
    review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]