app/models/admin.rb

  has_many :articles, dependent: :destroy
  has_many :breeds, dependent: :destroy

  Admin.create!(
   email: ENV['ADMIN_MAIL'],
   password: ENV['ADMIN_PASSWORD'],
)
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)